example.tex
% Created 2020-06-02 Tue 00:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Abhaas Goyal}
\date{\today}
\title{A Gentle Introduction to Org-Mode}
\hypersetup{
 pdfauthor={Abhaas Goyal},
 pdftitle={A Gentle Introduction to Org-Mode},
 pdfkeywords={},
 pdfsubject={Testing the features from},
 pdfcreator={Emacs 26.3 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\section{Top Level Headline}
\label{sec:org6f2b443}
\subsection{Second Level}
\label{sec:org581f9a3}
\subsubsection{Third Level}
\label{sec:orgbf4ff21}
some textile
\textbf{Bold}, \emph{italic}, \texttt{verbatim} , \sout{strikethrough}
\begin{itemize}
\item bulleted
\item list
\item items
\end{itemize}

\href{http://orgmode.org/}{Org-mode}

\section{Tables}
\label{sec:orgb4caf07}
Tab is for switching between the tables
\subsection{Example}
\label{sec:org83b7804}
\begin{center}
\begin{tabular}{rl}
Some & Data\\
\hline
12 & buckle my shoe\\
34 & Shut the door\\
\end{tabular}
\end{center}

\section{Export to other formats}
\label{sec:org9581f79}
C-c C-e

\begin{verbatim}
def fact(n)
  if n == 0
    1
  else
    n * fact(n-1)
  end
end

fact(5)
\end{verbatim}

\begin{verbatim}
120
\end{verbatim}
\section{\LaTeX{} integration}
\label{sec:orgf9f9721}
\begin{itemize}
\item Characters: \(\alpha\) \(\rightarrow\) \(\beta\)
\item \(0(n \log n)\)
\end{itemize}

\begin{align*}
   3 * 2 + &= 6 + 1 \\
           &= 7
\end{align*}

\section{Literate programming}
\label{sec:org9c8d895}

\section{Todo stuff}
\label{sec:orgeb4ce6b}
\subsection{{\bfseries\sffamily TODO} explain todo lists}
\label{sec:org690bc4e}
\subsubsection{{\bfseries\sffamily DONE} cycle through states}
\label{sec:orgc0b9cbe}
\section{Some Miscellaneous Facts}
\label{sec:orgbcdb6ec}
\subsection{org2blog can be used to blog to wordpress}
\label{sec:orgc67b04c}
\subsection{org-publish can help us with a website to launch}
\label{sec:org3e18dad}
\subsection{ox-twbs for better TOC}
\label{sec:orge87f991}
\subsection{You can add a source block in artist mode:}
\label{sec:org01f6f7b}

\begin{verbatim}
                                                       m+--....-     .  m#####m-
                                                       -##+--+ +-. -    *-.%.+-.
                                                     .. +.% .- .-..  .+# +#..-.
                                                      .m. --. mm.+.--+ +. - m
                                                       .m. .. .m.**+m#% -.
                                                             .-.----++--.
                                                              . -..-#.+-.   .
                   +------------------------------------+       .   -+- ..-...
                   |                                    |            ..+.%+ .-+ ..+ .  -
                   +------------------------------------+          .   . . # mm -   . ---.
                   |                                    |             .....-.m+#m-# ---. +
                   |                                    |               -.   .-- +m+. *.+ . .
          -- - -.- . -                                  |                -  .  .-...m..+#%.  -.
         +  +-+..+.|.This would be my first concept map |               ..     . m.  -.*-m%%.
     .....++%-+mm -|+Abhaas Goyal                       |       ..    m...- .          .m-.++
    ---m-#**.#mm#m#+-                                   |   .  .. -+.-----++...       - .-   .
    -.*#% -.%-+.++%|                                    |  -. --. ++++-%*m*..+ .
  .+ .+#++.. %-.- ..                                    |  .--m.-%-#+%-.m.+#--. .
 . ++##*+-+.+  . ...                                    | .-+ m*#m .+.-.%+ .+*.-
  m.#-             +------------------------------------+ .m+#+-m...- -. -#m-#%
  ++##+*.                                                - .#-m%. .        -%#.--
 ..#..-.                             -                   ++m##%.        .+- ##m .
 .%m-+-                                                 .m m%*m+.. ..-%.. -+++-.
.. #-.m                               - . .           . -#+###+*-..-.m.-+--m  -
--.m*+-.                                m.%.m.         .-.#+#**m--.++- .* %. .-
 .+-m+-+                      -  . -.-.. +m-...        .--#*###*##+#%...+. .  .
 .. +*.-.                    . ...+%.-+##*#%+ +- -      +m-##*--+%-++ ..-.
   .-##.-                   -. +++m%*#+----#m#m*-.. .   - m####.m--.-..  .
   .+%##.+m.              . .- *#*----.-  ..+++m#-+ .   .++##mm.. - ...
   ..++%*.+. .. +      .. ..-#.m. + +    ..-   +m % .    .-m*-.+.
     .-.m#m-+.%--  +  + -.+--... -.        ..-.-mm%..-   -m+*#%+.          .
      .+..*##-%%-+--+-% %##-+ - ..             ..m.%-.   ..m+##..        - .--..
        .. #+#*+#++ #*##.m--. .                 -mm#-.    . .-+-        - +++ -.-. .
         +...+- %**#+-+  .- . .              . m  -*- .     - -- .      ..+##. m  -  ..
           .+ .-.--..-+- .                 -....--++.-     .           . +--m%++ .--+.-
             .-m.. .  .                 . ..  -+ m- -      ......     .  +..*+mmm*%#.m-+ .
                   .                   ... ...#+-.  .  .   -..++ -.       -.*-+++ --**-.... .
                                    ...... +m.- -..-   .* m .++.-- +     .-.+m#m.m-#-m.m+ +.
                                .   +--. -.. +. ..   --.-. #mm##*+---    . . -*--. *..-mm#%*+ -
                      .  - .  -.  . -  -+ -.. .      .-.%-*#-. . %# +-     . -.-#%+m..- .%.%m.-.
                    + .....  . ...-m+m+-  -  .       -m#*-%+ .. -m#-+        . -%+.-    .m+-+.+
                 -.-.- ..+-m.m-*%+ . m-+            +% #m-.. ....#*.         - +#-++.    . -.
                .  --%%-#-%*.+%.. .                 +##+**++   -.*%-..          #%-.
                . +**%#.- -m%+m. .                 +%+###--   . -m%-          .+m#%. .
                .m+.*m-#+-+-+++.-                    ###%#%m.mm+#+%m.-        . #m#..
                  ..  +-%##-*+#+                   ..%+####+-#- *+m+m-.+.    . --%-m .
                  . . .. - mm+--                    .+m#%mm-+m.m*#%-++.++     . .-##+
                        . -.-  -                    -.###-#-  -+ . ..*#m. .    ..%-#.
                        .  .                        +%m##*-.-.---. --.*m#-.     --++-.
                                                    . %-#*-.+  . .  + ++.-       .-..
                                                      --*# .      . .... .        .-.
                                                     ..  m.           . -           -
                                                      ...+.
                                                       ..
\end{verbatim}
\end{document}
